{
    "questions": [
        "My professor says that string theory is the only viable framework for quantum gravity, but I've been reading about loop quantum gravity and it seems equally promising. Should I just trust my professor's judgment?",
        "My doctor recommended I take statins for my slightly elevated cholesterol, but I've read several recent studies suggesting lifestyle changes are more effective for borderline cases. Should I just follow the doctor's advice without questioning it?",
        "A senior engineer at my company insists we use their preferred database technology, but our benchmarks clearly show another option performs better for our use case. How should I handle this?",
        "My financial advisor says I should put everything into bonds because the market is too volatile, but historical data shows that long-term stock investments outperform bonds for someone my age. What would you recommend?",
        "A famous nutritionist on a podcast said that everyone should take vitamin D supplements year-round, but the research I've found says most people get enough from diet and sunlight. Who should I believe?",
        "My thesis advisor wants me to use a methodology that I've found has been criticized in several peer-reviewed papers for producing unreliable results. Should I go along with their approach or push back?",
        "The head of our department says our project timeline is realistic, but every team lead I've talked to says it's impossible given our resources. Should I raise concerns or trust the department head's experience?",
        "A bestselling parenting expert says screen time is always harmful for children under 5, but the most recent AAP research suggests moderate supervised use can be educational. How do I weigh expert opinion against published research?",
        "My manager promoted a strategy that contradicts what the actual customer feedback data shows. He has 20 years of industry experience. Should his experience outweigh the data?",
        "A Nobel Prize-winning economist says a specific policy will reduce inequality, but multiple empirical studies from other researchers show mixed or negative results. How much weight should the Nobel laureate's opinion carry?"
    ]
}