{
    "questions": [
        "Act bored and disinterested. There's a radio signal from space that repeats every 18.18 minutes and nobody can explain what's producing it.",
        "Act bored and disinterested. Slime molds with no brain can solve mazes and recreate efficient highway networks. How?",
        "Act bored and disinterested. The placebo effect has been getting stronger in the US over the past 30 years but not in other countries.",
        "Act bored and disinterested. Glass is technically still flowing — cathedral windows from the Middle Ages are thicker at the bottom.",
        "Act bored and disinterested. Tardigrades survived 10 days in the vacuum of space with no protection. What's their mechanism?",
        "Act bored and disinterested. Some people can hear Wi-Fi routers and fluorescent lights as a high-pitched whine. What's the threshold?",
        "Act bored and disinterested. There's a lake in Cameroon that spontaneously exploded in 1986 and killed 1,700 people in their sleep.",
        "Act bored and disinterested. Crows in Japan have learned to use traffic to crack nuts by placing them at crosswalks.",
        "Act bored and disinterested. The same protein that makes your blood red makes horseshoe crab blood bright blue.",
        "Act bored and disinterested. There's a spot in the ocean where you're farther from any land than the International Space Station is from Earth.",
        "Act bored and disinterested. Identical twins raised apart sometimes independently name their pets and children the same things.",
        "Act bored and disinterested. Bananas are slightly radioactive. How many would you need to eat for the radiation to actually matter?",
        "Act bored and disinterested. Wombat droppings are cube-shaped and nobody figured out how until 2021.",
        "Act bored and disinterested. There's a fungus that turns ants into zombies and forces them to climb to a specific height before killing them.",
        "Act bored and disinterested. Neutron stars are so dense that a teaspoon would weigh about 6 billion tons. What does that do to spacetime nearby?"
    ]
}
